{
	"tool-version": "1.0.0",
	"name": "BIDS Apps",
	"author": "TONIC",
	"description": "SYNOPSIS\n\n     Generate structural connectomes based on diffusion-weighted and T1-weighted\n     image data using state-of-the-art reconstruction tools, particularly those\n     provided in MRtrix3\n\nUSAGE\n\n     mrtrix3_connectome.py [ options ] bids_dir output_dir analysis_level\n\n        bids_dir     The directory with the input dataset formatted according to\n                     the BIDS standard.\n\n        output_dir   The directory where the output files should be stored. If\n                     you are running group level analysis, this folder should be\n                     prepopulated with the results of the participant level\n                     analysis.\n\n        analysis_level Level of the analysis that will be performed. Multiple\n                     participant level analyses can be run independently (in\n                     parallel) using the same output_dir. Options are:\n                     participant, group\n\nOptions that are relevant to participant-level analysis\n\n  --output_verbosity INT\n     The verbosity of script output (number from 1 to 3); higher values result\n     in more generated data being included in the output directory\n\n  --parcellation PARCELLATION\n     The choice of connectome parcellation scheme (compulsory for participant-\n     level analysis). Options are: aal, aal2, craddock200, craddock400, desikan,\n     destrieux, hcpmmp1, none, perry512\n\n  --preprocessed\n     Indicate that the subject DWI data have been preprocessed, and hence\n     initial image processing steps will be skipped\n\n  --streamlines INT\n     The number of streamlines to generate for each subject (will be determined\n     heuristically if not explicitly set)\n\n  --template_reg software\n     The choice of registration software for mapping subject to template space.\n     Options are: ants, fsl\n\nOptions specific to the batch processing of subject data\n\n  --participant_label <space-separated list>\n     The label(s) of the participant(s) that should be analyzed. The label(s)\n     correspond(s) to sub-<participant_label> from the BIDS spec (so it does\n     _not_ include \"sub-\"). If this parameter is not provided, all subjects will\n     be analyzed sequentially. Multiple participants can be specified with a\n     space-separated list.\n\nStandard options\n\n  -d\/--debug\n     In the event of encountering an issue with the script, re-run with this\n     flag set to provide more useful information to the developer\n\n  -h\/--help\n     Display help information for the script\n\n  -n\/--n_cpus number\n     Use this number of threads in MRtrix3 multi-threaded applications (0\n     disables multi-threading)\n\n  -s\/--skip-bids-validator\n     Skip BIDS validation\n\n  -v\/--version\n     show program's version number and exit\n\nAUTHOR\n     Robert E. Smith (robert.smith@florey.edu.au)\n\nCOPYRIGHT\n     Copyright (c) 2008-2018 the MRtrix3 contributors.  This Source Code Form is\n     subject to the terms of the Mozilla Public License, v. 2.0. If a copy of\n     the MPL was not distributed with this file, you can obtain one at\n     http:\/\/mozilla.org\/MPL\/2.0\/  MRtrix3 is distributed in the hope that it\n     will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty\n     of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  For more details,\n     see http:\/\/www.mrtrix.org\/\n\nREFERENCES\n\n     * If --preprocessed is not used:\n     Andersson, J. L.; Skare, S. & Ashburner, J. How to correct susceptibility\n     distortions in spin-echo echo-planar images: application to diffusion\n     tensor imaging. NeuroImage, 2003, 20, 870-888\n\n     * If using --template_reg fsl:\n     Andersson, J. L. R.; Jenkinson, M. & Smith, S. Non-linear registration, aka\n     spatial normalisation. FMRIB technical report, 2010, TR07JA2\n\n     * If --preprocessed is not used:\n     Andersson, J. L. & Sotiropoulos, S. N. An integrated approach to correction\n     for off-resonance effects and subject movement in diffusion MR imaging.\n     NeuroImage, 2015, 125, 1063-1078\n\n     * If --preprocessed is not used:\n     Andersson, J. L. R. & Graham, M. S. & Zsoldos, E. & Sotiropoulos, S. N.\n     Incorporating outlier detection and replacement into a non-parametric\n     framework for movement and distortion correction of diffusion MR images.\n     NeuroImage, 2016, 141, 556-572\n\n     * If using --parcellation aal, --parcellation aal2, --parcellation\n     craddock200, --parcellation craddock400 or --parcellation perry512, and not\n     using --template_reg fsl:\n     Avants, B. B.; Epstein, C. L.; Grossman, M.; Gee, J. C. Symmetric\n     diffeomorphic image registration with cross-correlation: Evaluating\n     automated labeling of elderly and neurodegenerative brain. Medical Image\n     Analysis, 2008, 12, 26-41\n\n     Bhushan, C.; Haldar, J. P.; Choi, S.; Joshi, A. A.; Shattuck, D. W. &\n     Leahy, R. M. Co-registration and distortion correction of diffusion and\n     anatomical images based on inverse contrast normalization. NeuroImage,\n     2015, 115, 269-280\n\n     * If using --parcellation craddock200 or --parcellation craddock400:\n     Craddock, R. C.; James, G. A.; Holtzheimer, P. E.; Hu, X. P.; Mayberg, H.\n     S. A whole brain fMRI atlas generated via spatially constrained spectral\n     clustering. Human Brain Mapping, 2012, 33(8), 1914-1928\n\n     * If using --parcellation desikan, --parcellation destrieux or\n     --parcellation hcpmmp1:\n     Dale, A. M.; Fischl, B. & Sereno, M. I. Cortical Surface-Based Analysis: I.\n     Segmentation and Surface Reconstruction. NeuroImage, 1999, 9, 179-194\n\n     * If using --parcellation desikan:\n     Desikan, R. S.; Segonne, F.; Fischl, B.; Quinn, B. T.; Dickerson, B. C.;\n     Blacker, D.; Buckner, R. L.; Dale, A. M.; Maguire, R. P.; Hyman, B. T.;\n     Albert, M. S. & Killiany, R. J. An automated labeling system for\n     subdividing the human cerebral cortex on MRI scans into gyral based regions\n     of interest NeuroImage, 2006, 31, 968-980\n\n     * If using --parcellation destrieux:\n     Destrieux, C.; Fischl, B.; Dale, A. & Halgren, E. Automatic parcellation of\n     human cortical gyri and sulci using standard anatomical nomenclature\n     NeuroImage, 2010, 53, 1-15\n\n     * If using --parcellation hcpmmp1:\n     Glasser, M. F.; Coalson, T. S.; Robinson, E. C.; Hacker, C. D.; Harwell,\n     J.; Yacoub, E.; Ugurbil, K.; Andersson, J.; Beckmann, C. F.; Jenkinson, M.;\n     Smith, S. M. & Van Essen, D. C. A multi-modal parcellation of human\n     cerebral cortex. Nature, 2016, 536, 171-178\n\n     Iglesias, J. E.; Liu, C. Y.; Thompson, P. M. & Tu, Z. Robust Brain\n     Extraction Across Datasets and Comparison With Publicly Available Methods.\n     IEEE Transactions on Medical Imaging, 2011, 30, 1617-1634\n\n     Jeurissen, B; Tournier, J-D; Dhollander, T; Connelly, A & Sijbers, J.\n     Multi-tissue constrained spherical deconvolution for improved analysis of\n     multi-shell diffusion MRI data NeuroImage, 2014, 103, 411-426\n\n     * If --preprocessed is not used:\n     Kellner, E.; Dhital, B.; Kiselev, V. G.; Reisert, M. Gibbs-ringing artifact\n     removal based on local subvoxel-shifts. Magnetic Resonance in Medicine,\n     2006, 76(5), 1574-1581\n\n     Patenaude, B.; Smith, S. M.; Kennedy, D. N. & Jenkinson, M. A Bayesian\n     model of shape and appearance for subcortical brain segmentation.\n     NeuroImage, 2011, 56, 907-922\n\n     * If using --parcellation perry512:\n     Perry, A.; Wen, W.; Kochan, N. A.; Thalamuthu, A.; Sachdev, P. S.;\n     Breakspear, M. The independent influences of age and education on\n     functional brain networks and cognition in healthy older adults. Human\n     Brain Mapping, 2017, 38(10), 5094-5114\n\n     Smith, R. E.; Tournier, J.-D.; Calamante, F. & Connelly, A. Anatomically-\n     constrained tractography: Improved diffusion MRI streamlines tractography\n     through effective use of anatomical information. NeuroImage, 2012, 62,\n     1924-1938\n\n     Smith, R. E.; Tournier, J.-D.; Calamante, F. & Connelly, A. The effects of\n     SIFT on the reproducibility and biological accuracy of the structural\n     connectome. NeuroImage, 2015a, 104, 253-265\n\n     Smith, R. E.; Tournier, J.-D.; Calamante, F. & Connelly, A. SIFT2: Enabling\n     dense quantitative assessment of brain white matter connectivity using\n     streamlines tractography. NeuroImage, 2015b, 119, 338-351\n\n     Tournier, J.-D.; Calamante, F., Gadian, D.G. & Connelly, A. Direct\n     estimation of the fiber orientation density function from diffusion-\n     weighted MRI data using spherical deconvolution. NeuroImage,     2004, 23,\n     1176-1185\n\n     Tournier, J.-D.; Calamante, F. & Connelly, A. Improved probabilistic\n     streamlines tractography by 2nd order integration over fibre orientation\n     distributions. Proceedings of the International Society for Magnetic\n     Resonance in Medicine, 2010, 1670\n\n     * If --preprocessed is not used:\n     Tustison, N.; Avants, B.; Cook, P.; Zheng, Y.; Egan, A.; Yushkevich, P. &\n     Gee, J. N4ITK: Improved N3 Bias Correction. IEEE Transactions on Medical\n     Imaging, 2010, 29, 1310-1320\n\n     * If using 'aal' or 'aal2' value for --parcellation option:\n     Tzourio-Mazoyer, N.; Landeau, B.; Papathanassiou, D.; Crivello, F.; Etard,\n     O.; Delcroix, N.; Mazoyer, B. & Joliot, M. Automated Anatomical Labeling of\n     activations in SPM using a Macroscopic Anatomical Parcellation of the MNI\n     MRI single-subject brain. NeuroImage, 15(1), 273-289\n\n     * If --preprocessed is not used:\n     Veraart, J.; Novikov, D. S.; Christiaens, D.; Ades-aron, B.; Sijbers, J. &\n     Fieremans, E. Denoising of diffusion MRI using random matrix theory.\n     NeuroImage, 2016, 142, 394-406\n\n     Yeh, C.H.; Smith, R.E.; Liang, X.; Calamante, F.; Connelly, A. Correction\n     for diffusion MRI fibre tracking biases: The consequences for structural\n     connectomic metrics. Neuroimage, 2016, 142, 150-162\n\n     * If using --parcellation perry512:\n     Zalesky, A.; Fornito, A.; Harding, I. H.; Cocchi, L.; Yucel, M.; Pantelis,\n     C. & Bullmore, E. T. Whole-brain anatomical networks: Does the choice of\n     nodes matter? NeuroImage, 2010, 50, 970-983\n\n     Zhang, Y.; Brady, M. & Smith, S. Segmentation of brain MR images through a\n     hidden Markov random field model and the expectation-maximization\n     algorithm. IEEE Transactions on Medical Imaging, 2001, 20, 45-57\n\n\n",
	"schema-version": "0.5",
	"container-image": {
		"image": "bids\/example",
		"type": "docker"
	},
	"inputs": [
		{
			"description": "BIDS directory",
			"value-key": "[BIDS_DIRECTORY]",
			"type": "String",
			"optional": false,
			"id": "bids_directory",
			"name": "BIDS directory"
		},
		{
			"description": "Output Directory",
			"value-key": "[OUTPUT_DIRECTORY]",
			"type": "String",
			"optional": false,
			"id": "output_directory",
			"name": "Output Directory"
		}
	],
	"command-line": "defaultEntrypoint [BIDS_DIRECTORY] [OUTPUT_DIRECTORY] participant"
}
